In [3]:
import pandas as pd
import numpy as np

In [9]:
index = [('California',2000),('California',2010),('New York',2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations = [33871648,37253956,18976457,19378102,20851820,25145561]
pop = pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [10]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [11]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [12]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [13]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [14]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [15]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [16]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [17]:
pop_df = pd.DataFrame({'total':pop,'under18':[9267089,9284094,4687374,4318033,5906301,6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [18]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [19]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [20]:
df = pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['data1','data2'])
df

        data1     data2
a 1  0.515258  0.158171
  2  0.483828  0.420796
b 1  0.588253  0.162615
  2  0.402554  0.781299

In [21]:
data = {
    ('California',2000):33871648,
    ('California',2010):37253946,
    ('Texas',2000):20851820,
    ('Texas',2010):25145561,
    ('New York',2000):18976457,
    ('New York',2010):19378102
}
pd.Series(data)

California  2000    33871648
            2010    37253946
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [22]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [23]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [24]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [8]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
              labels = [[0,0,1,1],[0,1,0,1]]
)

TypeError: __new__() got an unexpected keyword argument 'labels'

In [25]:
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [26]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

data = np.round(np.random.randn(4,6),1)

In [27]:
data

array([[-0.2,  2.1,  1.2,  0.7, -0.4,  0.4],
       [ 2.6, -1.1, -1.2, -0.4,  0.3, -0. ],
       [ 1.1,  1.5, -0.9,  2.1,  0.5, -0.7],
       [ 2.5, -0.6,  0.2, -0.4, -0.4, -0.3]])

In [28]:
data[:,::2]*=10
data

array([[ -2. ,   2.1,  12. ,   0.7,  -4. ,   0.4],
       [ 26. ,  -1.1, -12. ,  -0.4,   3. ,  -0. ],
       [ 11. ,   1.5,  -9. ,   2.1,   5. ,  -0.7],
       [ 25. ,  -0.6,   2. ,  -0.4,  -4. ,  -0.3]])

In [29]:
data+=37
health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  39.1  49.0  37.7  33.0  37.4
     2      63.0  35.9  25.0  36.6  40.0  37.0
2014 1      48.0  38.5  28.0  39.1  42.0  36.3
     2      62.0  36.4  39.0  36.6  33.0  36.7

In [30]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      49.0  37.7
     2      25.0  36.6
2014 1      28.0  39.1
     2      39.0  36.6

In [31]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [32]:
pop['California',2000]

33871648

In [33]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [34]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [35]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [36]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [37]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [38]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  39.1  49.0  37.7  33.0  37.4
     2      63.0  35.9  25.0  36.6  40.0  37.0
2014 1      48.0  38.5  28.0  39.1  42.0  36.3
     2      62.0  36.4  39.0  36.6  33.0  36.7

In [39]:
health_data['Guido','HR']

year  visit
2013  1        49.0
      2        25.0
2014  1        28.0
      2        39.0
Name: (Guido, HR), dtype: float64

In [40]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      35.0  39.1
     2      63.0  35.9

In [41]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        35.0
      2        63.0
2014  1        48.0
      2        62.0
Name: (Bob, HR), dtype: float64

In [42]:
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      35.0  49.0  33.0
2014 1      48.0  28.0  42.0

In [43]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6),index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.482923
      2      0.735594
c     1      0.943514
      2      0.147946
b     1      0.701826
      2      0.033666
dtype: float64

In [44]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [45]:
data = data.sort_index()

In [46]:
data['a':'b']

char  int
a     1      0.482923
      2      0.735594
b     1      0.701826
      2      0.033666
dtype: float64

In [47]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [48]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [49]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [50]:
pop_flat = pop.reset_index(name='population')

In [51]:
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [52]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [53]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  39.1  49.0  37.7  33.0  37.4
     2      63.0  35.9  25.0  36.6  40.0  37.0
2014 1      48.0  38.5  28.0  39.1  42.0  36.3
     2      62.0  36.4  39.0  36.6  33.0  36.7

In [54]:
data_mean = health_data.mean(level='year')

In [55]:
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     49.0  37.50  37.0  37.15  36.5  37.2
2014     55.0  37.45  33.5  37.85  37.5  36.5

In [56]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  40.833333  37.283333
2014  42.000000  37.266667